app/controllers/items_controller.rb

  def create
    @item.user_id = current_user.id

    if @item.save
---
UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2021-08-12 01:10:32.517931"], ["id", 5]]