app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

INSERT INTO "items" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @item = Item.new(item_params)
    @item.user_id = current_user.id

    if @item.save

UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2021-08-12 01:10:32.517931"], ["id", 5]]
---
  def update
    if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_item
      @item = Item.find(params[:id])