app/controllers/products_controller.rb

  def page
    @items = Item.all
---
SELECT "items".* FROM "items"