app/models/user.rb

  def assign_role
    self.role = Role.find_by name: 'Regular' if role.nil?
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]